/**
 * 香港 SVG path data (auto-generated)
 * Source: Aliyun DataV GeoJSON
 * Generated: 2026-04-03T03:54:25.601Z
 */

import {ProvinceMapData} from './index';

const data: ProvinceMapData = {
  id: 'hongkong',
  name: '香港',
  adcode: 810000,
  viewBox: '0 0 580 500',
  cities: [
    {
      name: '中西区',
      path: 'M314.5,360.1 L271.0,332.9 L314.5,360.1 Z',
      cx: 292.7,
      cy: 343.1,
    },
    {
      name: '东区',
      path: 'M341.1,360.1 L390.2,353.3 L341.1,360.1 Z',
      cx: 358.8,
      cy: 349,
    },
    {
      name: '南区',
      path: 'M272.3,342.9 L392.6,414.8 L272.3,342.9 Z',
      cx: 345,
      cy: 384.3,
    },
    {
      name: '九龙城区',
      path: 'M324.2,259.9 L358.3,318.0 L324.2,259.9 Z',
      cx: 331.3,
      cy: 282.2,
    },
    {
      name: '观塘区',
      path: 'M344.2,274.3 L378.8,330.7 L344.2,274.3 Z',
      cx: 365.9,
      cy: 295.8,
    },
    {
      name: '荃湾区',
      path: 'M294.8,229.4 L157.9,292.5 L294.8,229.4 Z',
      cx: 253.6,
      cy: 224.6,
    },
    {
      name: '屯门区',
      path: 'M230.1,217.1 L90.2,199.2 L230.1,217.1 Z',
      cx: 166.9,
      cy: 213.9,
    },
    {
      name: '元朗区',
      path: 'M278.0,187.4 L244.6,75.9 L111.9,178.4 L278.0,187.4 Z',
      cx: 211.4,
      cy: 146.5,
    },
    {
      name: '北区',
      path: 'M456.3,86.7 L239.6,67.2 L248.2,138.3 L456.3,86.7 Z',
      cx: 343.9,
      cy: 74.8,
    },
    {
      name: '大埔区',
      path: 'M456.3,86.7 L266.1,164.6 L456.3,86.7 Z M384.0,165.0 L387.2,220.1 L484.9,146.3 L384.0,165.0 Z',
      cx: 358.3,
      cy: 134.7,
    },
    {
      name: '西贡区',
      path: 'M483.1,158.2 L361.9,245.4 L401.6,352.6 L407.8,214.8 L502.0,240.8 L483.1,158.2 Z',
      cx: 440.1,
      cy: 248.9,
    },
    {
      name: '沙田区',
      path: 'M349.4,168.3 L296.8,265.7 L388.1,225.0 L349.4,168.3 Z',
      cx: 340.8,
      cy: 218,
    },
    {
      name: '葵青区',
      path: 'M238.9,277.7 L299.1,316.5 L294.8,229.4 L238.9,277.7 Z',
      cx: 282.3,
      cy: 264.7,
    },
    {
      name: '离岛区',
      path: 'M220.6,295.7 L84.3,299.6 L43.0,424.6 L177.4,403.2 L220.6,295.7 Z',
      cx: 126.6,
      cy: 364.9,
    },
  ],
};

export default data;
